In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

%matplotlib inline

import warnings
warnings.filterwarnings('ignore')

In [2]:
#Getting the file path
DATA_PATH = '/Users/TygaBRii/Downloads/ML/'
file_transc = DATA_PATH+'train_transaction.csv'
file_idn = DATA_PATH+'train_identity.csv'
print(file_transc,'\n', file_idn)

/Users/TygaBRii/Downloads/ML/train_transaction.csv
 /Users/TygaBRii/Downloads/ML/train_identity.csv

In [3]:
#TRANSACTION TABLE
train_txn = pd.read_csv(file_transc)
print(train_txn.shape)
train_txn.head()

(590540, 394)

,TransactionID,isFraud,TransactionDT,TransactionAmt,ProductCD,card1,card2,card3,card4,card5,...,V330,V331,V332,V333,V334,V335,V336,V337,V338,V339
0,2987000,0,86400,68.5,W,13926,NaN,150.0,discover,142.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2987001,0,86401,29.0,W,2755,404.0,150.0,mastercard,102.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,2987002,0,86469,59.0,W,4663,490.0,150.0,visa,166.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,2987003,0,86499,50.0,W,18132,567.0,150.0,mastercard,117.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,2987004,0,86506,50.0,H,4497,514.0,150.0,mastercard,102.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [4]:
#IDENTITY TABLE
train_idn = pd.read_csv(file_idn)
print(train_idn.shape)
train_idn.head()

(144233, 41)

,TransactionID,id_01,id_02,id_03,id_04,id_05,id_06,id_07,id_08,id_09,...,id_31,id_32,id_33,id_34,id_35,id_36,id_37,id_38,DeviceType,DeviceInfo
0,2987004,0.0,70787.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,samsung browser 6.2,32.0,2220x1080,match_status:2,T,F,T,T,mobile,SAMSUNG SM-G892A Build/NRD90M
1,2987008,-5.0,98945.0,NaN,NaN,0.0,-5.0,NaN,NaN,NaN,...,mobile safari 11.0,32.0,1334x750,match_status:1,T,F,F,T,mobile,iOS Device
2,2987010,-5.0,191631.0,0.0,0.0,0.0,0.0,NaN,NaN,0.0,...,chrome 62.0,NaN,NaN,NaN,F,F,T,T,desktop,Windows
3,2987011,-5.0,221832.0,NaN,NaN,0.0,-6.0,NaN,NaN,NaN,...,chrome 62.0,NaN,NaN,NaN,F,F,T,T,desktop,NaN
4,2987016,0.0,7460.0,0.0,0.0,1.0,0.0,NaN,NaN,0.0,...,chrome 62.0,24.0,1280x800,match_status:2,T,F,T,T,desktop,MacOS

# Handling Addr1 & 2
Creating a range for both adress reducing categories

In [5]:
train_txn[['addr1', 'addr2']].head()

   addr1  addr2
0  315.0   87.0
1  325.0   87.0
2  330.0   87.0
3  476.0   87.0
4  420.0   87.0

In [6]:
#   ADDR1

print('Unique vaues : ', train_txn.addr1.nunique())
print('Max value :', train_txn['addr1'].max())
print('Min value :', train_txn['addr1'].min())

Unique vaues :  332
Max value : 540.0
Min value : 100.0

In [7]:
#   ADDR2

print('Unique vaues : ', train_txn.addr2.unique())
print('Max value :', train_txn['addr2'].max())
print('Min value :', train_txn['addr2'].min())

Unique vaues :  [ 87.  nan  96.  35.  60.  98.  43.  65.  32.  13.  31. 101.  24.  16.
  15.  19.  71.  59. 102.  44.  26.  69.  47.  78.  88.  66.  72.  22.
  57.  25.  17.  30.  29.  21.  14.  49.  83.  75.  34.  86.  48.  68.
  23.  70.  62.  54.  50.  52.  39.  76.  10.  73.  97.  63.  27.  28.
  38.  74.  77.  92.  79.  84.  82.  40.  36.  46.  18.  20.  89.  61.
  94. 100.  55.  51.  93.]
Max value : 102.0
Min value : 10.0

### Assiging the range to adrr1 & 2

In [8]:
# Addr1

cut_labels = ['1', '2', '3', '4']
cut_bins = [0, 200, 300, 400, train_txn['addr1'].max()]
train_txn['addr1'] = pd.cut(train_txn['addr1'], bins=cut_bins, labels=cut_labels)

print('Unique values:', train_txn['addr1'].unique())

Unique values: [3, 4, 2, 1, NaN]
Categories (4, object): [1 < 2 < 3 < 4]

In [9]:
#Addr2

## range : 0-20 is 1, 21-40 is 2, 41-60 is 3, 61-80 is 4, 81-max is 5
## Label : 1-5

cut_labels = ['1', '2', '3', '4', '5']
cut_bins = [0, 20, 40, 60, 80, train_txn['addr2'].max()]
train_txn['addr2'] = pd.cut(train_txn['addr2'], bins=cut_bins, labels=cut_labels)

print('Unique values:', train_txn['addr2'].unique())

Unique values: [5, NaN, 2, 3, 4, 1]
Categories (5, object): [1 < 2 < 3 < 4 < 5]

# Handling card1-6

card4 & card 6 are already grouped into good categories.

A range was created for each column and each range was grouped into one category.
For ex : range 1 to 100 wil be category 1 and 101 to 200 will be category 2

In [10]:
train_txn[['card1', 'card2', 'card3', 'card4', 'card5', 'card6']].head()

   card1  card2  card3       card4  card5   card6
0  13926    NaN  150.0    discover  142.0  credit
1   2755  404.0  150.0  mastercard  102.0  credit
2   4663  490.0  150.0        visa  166.0   debit
3  18132  567.0  150.0  mastercard  117.0   debit
4   4497  514.0  150.0  mastercard  102.0  credit

In [11]:
#   CARD1

print('Unique values:', train_txn.card1.unique())
print('Number of unique categories : ', train_txn.card1.nunique())
    
print('Max value :', train_txn['card1'].max())
print('Min value :', train_txn['card1'].min())

Unique values: [13926  2755  4663 ... 13166  8767 18038]
Number of unique categories :  13553
Max value : 18396
Min value : 1000

In [12]:
# CARD1

cut_labels = ['1', '2', '3', '4', '5', '6']
cut_bins = [0, 4001, 7001, 10000, 13000, 16000, train_txn['card1'].max()]
train_txn['card1'] = pd.cut(train_txn['card1'], bins=cut_bins, labels=cut_labels)

print('Unique values:', train_txn['card1'].unique())

Unique values: [5, 1, 2, 6, 4, 3]
Categories (6, object): [1 < 2 < 3 < 4 < 5 < 6]

In [13]:
#   CARD2

print('Number of unique categories : ', train_txn.card2.nunique())
    
print('Max value :', train_txn['card2'].max())
print('Min value :', train_txn['card2'].min())

Number of unique categories :  500
Max value : 600.0
Min value : 100.0

In [14]:
# CARD2

cut_labels = ['1', '2', '3', '4', '5']
cut_bins = [0, 200, 300, 400, 500, train_txn['card2'].max()]
train_txn['card2'] = pd.cut(train_txn['card2'], bins=cut_bins, labels=cut_labels)

print('Unique values:', train_txn['card2'].unique())

Unique values: [NaN, 4, 5, 3, 1, 2]
Categories (5, object): [1 < 2 < 3 < 4 < 5]

In [15]:
#   CARD3

print('Number of unique categories : ', train_txn.card3.nunique())
    
print('Max value :', train_txn['card3'].max())
print('Min value :', train_txn['card3'].min())

Number of unique categories :  114
Max value : 231.0
Min value : 100.0

In [16]:
# CARD3

cut_labels = ['1', '2', '3']
cut_bins = [0, 150, 200, train_txn['card3'].max()]
train_txn['card3'] = pd.cut(train_txn['card3'], bins=cut_bins, labels=cut_labels)

print('Unique values:', train_txn['card3'].unique())

Unique values: [1, 2, 3, NaN]
Categories (3, object): [1 < 2 < 3]

In [17]:
# CARD4
print('Unique values:', train_txn.card4.unique())

Unique values: ['discover' 'mastercard' 'visa' 'american express' nan]

In [18]:
# CARD5

print('Number of unique categories : ', train_txn.card5.nunique())
    
print('Max value :', train_txn['card5'].max())
print('Min value :', train_txn['card5'].min())

Number of unique categories :  119
Max value : 237.0
Min value : 100.0

In [19]:
# CARD5

cut_labels = ['1', '2', '3']
cut_bins = [0, 150, 200, train_txn['card5'].max()]
train_txn['card5'] = pd.cut(train_txn['card5'], bins=cut_bins, labels=cut_labels)

print('Unique values:', train_txn['card3'].unique())

Unique values: [1, 2, 3, NaN]
Categories (3, object): [1 < 2 < 3]

In [20]:
#   CARD6
print('Unique values:', train_txn.card6.unique())

Unique values: ['credit' 'debit' nan 'debit or credit' 'charge card']